Documents/DMS_ОтчетПоРекламнойКампании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_ОтчетПоРекламнойКампании</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.DMS_РекламныеКампании</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КооперативнаяРеклама</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Представители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламнаяКампания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКампании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Модели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчеты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/DMS_РекламнаяКампания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_РекламнаяКампания</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.DMS_РекламныеКампанииПредставителей</xr:Item>
				<xr:Item>AccumulationRegister.DMS_РекламныеКампании</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ВидыОперацийРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПредложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ВидыПредложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КооперативнаяРеклама</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедиаРесурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МедиаРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Представители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_СтатусыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКампании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРазмещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыРазмещенияМедиа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматМедиаРесурса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ФорматыМедиаРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонКампании</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Модели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтоимостьВзаиморасчеты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/DMS_ОтчетПоРекламнойКампании/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.РекламнаяКампания) Тогда
		НаименованиеРекламнойКампании = Объект.РекламнаяКампания.Наименование;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеРекламнойКампанииНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.РекламнаяКампания) Тогда
		
		ПараметрыФормы = Новый Структура("Ключ",Объект.РекламнаяКампания);
		
		ОткрытьФорму("Документ.DMS_РекламнаяКампания.Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма);
		
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура НаименованиеРекламнойКампанииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму("Документ.DMS_РекламнаяКампания.ФормаВыбора",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеРекламнойКампанииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.DMS_РекламнаяКампания") 
		И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		НаименованиеРекламнойКампании = ПолучитьРеквизитСсылки(ВыбранноеЗначение,"Наименование");
		Объект.РекламнаяКампания = ВыбранноеЗначение;
		ЗаполнитьНаОснованииРекламнойКампании();
	Иначе 
	
		Объект.Модели.Очистить();
		
		НаименованиеРекламнойКампании = "";
		Объект.РекламнаяКампания = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитСсылки(Ссылка,ИмяРеквизита)

	Возврат Ссылка[ИмяРеквизита];

КонецФункции // ПолучитьРеквизитСсылки()

&НаКлиенте
Процедура НаименованиеРекламнойКампанииОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.Модели.Очистить();
	
	Объект.РекламнаяКампания = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеРекламнойКампанииОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.РекламнаяКампания) Тогда
		
		ПараметрыФормы = Новый Структура("Ключ",Объект.РекламнаяКампания);
		
		ОткрытьФорму("Документ.DMS_РекламнаяКампания.Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма);
		
	Иначе 
		ОткрытьФорму("Документ.DMS_РекламнаяКампания.ФормаВыбора",,Элемент);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаОснованииРекламнойКампании()
	
	Объект.Модели.Очистить();
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	
	мОбъект.Заполнить(Объект.РекламнаяКампания);
	
	ЗначениеВРеквизитФормы(мОбъект,"Объект");	
	
КонецПроцедуры // ЗаполнитьНаОснованииРекламнойКампании()

&НаСервере
Функция ОтправитьНаСогласованиеНаСервере(Ссылка)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Предмет", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	СогласованиеОтчетов.Ссылка КАК Ссылка
		|ИЗ
		|	БизнесПроцесс.DMS_СогласованиеОтчетовПоРекламнойКампании КАК СогласованиеОтчетов
		|ГДЕ
		|	СогласованиеОтчетов.Предмет = &Предмет
		|	И НЕ СогласованиеОтчетов.ПометкаУдаления
		|	И НЕ СогласованиеОтчетов.Стартован
		|	И НЕ СогласованиеОтчетов.Завершен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли; 
	
	БизнесПроцесс = БизнесПроцессы.DMS_СогласованиеОтчетовПоРекламнойКампании.СоздатьБизнесПроцесс();
	БизнесПроцесс.Заполнить(Ссылка);
	
	БизнесПроцессСсылка = БизнесПроцессы.DMS_СогласованиеОтчетовПоРекламнойКампании.ПолучитьСсылку();
	БизнесПроцесс.УстановитьСсылкуНового(БизнесПроцессСсылка);
	БизнесПроцесс.ОбменДанными.Загрузка = Истина;
	БизнесПроцесс.Записать();
	
	Возврат БизнесПроцессСсылка;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Предупреждение("Сначала необходимо записать отчет",15,"Внимание");
		Возврат;
	КонецЕсли; 
	
	СсылкаБизнесПроцесс = ОтправитьНаСогласованиеНаСервере(Объект.Ссылка);
	
	ПараметрыФормы = Новый Структура("Ключ",СсылкаБизнесПроцесс);	
	ОткрытьФорму("БизнесПроцесс.DMS_СогласованиеОтчетовПоРекламнойКампании.Форма.ФормаБизнесПроцесса",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура МоделиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МоделиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
